**Q6. Filter the DataFrame to include only students whose Age > 21.**

In [1]:
import pandas as pd

In [9]:
data = pd.DataFrame({"Name":{"0":"Amit","1":"Bhavna","2":"Chetan"},"Age":{"0":21,"1":22,"2":23},"Marks":{"0":87,"1":90,"2":85},"passed":{"0":"true","1":"true","2":"true"}})

In [10]:
data

     Name  Age  Marks passed
0    Amit   21     87   true
1  Bhavna   22     90   true
2  Chetan   23     85   true

In [11]:
filterted_data = data[data["Age"]>21]

In [12]:
filterted_data

     Name  Age  Marks passed
1  Bhavna   22     90   true
2  Chetan   23     85   true